### pandans 和 numpy的区别？
#### numpy方便对【数组】进行处理 而方便对[表格]中的数据进行处理

### pandas常用的两个工具:series dataframe

### Series
    1.自带索引
    2.可自定义索引
    3.和字典联系起来
    4.布尔索引
    5.数值运算

### 1.自带索引

In [18]:
import pandas as pd
obj=pd.Series([4,5,6,7])
obj # 自带索引

0    4
1    5
2    6
3    7
dtype: int64

In [19]:
obj.values

array([4, 5, 6, 7], dtype=int64)

In [20]:
obj.index # 描述性

RangeIndex(start=0, stop=4, step=1)

### 2.自定义索引

In [17]:
obj_2=pd.Series(['孔','维云'],index=['姓','名'])
obj_2

姓     孔
名    维云
dtype: object

In [15]:
obj_2.index

Index(['姓', '名'], dtype='object')

In [16]:
obj_2['姓'] # 根据索引调用

'孔'

### 3.和字典联系起来

In [21]:
obj_3=pd.Series({'姓':'孔','名':'维云'})
obj_3

姓     孔
名    维云
dtype: object

In [22]:
obj_3.values

array(['孔', '维云'], dtype=object)

In [36]:
obj_3['名']

'维云'

In [39]:
price={'rice':10,'chicken':20,'flower':15,'hamburger':15}
need=['rice','hamburger','potato']
all=pd.Series(price,index=need)
all

rice         10.0
hamburger    15.0
potato        NaN
dtype: float64

In [43]:
all.isnull() # 判断有无空值

rice         False
hamburger    False
potato        True
dtype: bool

In [48]:
all.index.name='need'
all.name='price of needes' #类似于表格命名
# all.value.name='price'
all

need
rice         10.0
hamburger    15.0
potato        NaN
Name: price of needes, dtype: float64

### 4.布尔索引

In [24]:
obj_4=pd.Series([1,2,3,4])
obj_4>=2

0    False
1     True
2     True
3     True
dtype: bool

### 5.数值运算

In [34]:
obj_4=pd.Series([1,2,3,4])
obj_4-2

0   -1
1    0
2    1
3    2
dtype: int64

In [35]:
1 in obj_4 # 判断

True

### Dataframe

In [63]:
import pandas as pd
dic={'data':['北京','上海','郑州','三亚','新乡'],
'year':[2000,2001,2002,2002,2003],
'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=pd.DataFrame(dic)
frame

  data  year  pop
0   北京  2000  1.5
1   上海  2001  1.7
2   郑州  2002  3.6
3   三亚  2002  2.4
4   新乡  2003  2.9

In [66]:
pd.DataFrame(dic,columns=['year','data','pop'],index=['one','two','there','four','five'])

       year data  pop
one    2000   北京  1.5
two    2001   上海  1.7
there  2002   郑州  3.6
four   2002   三亚  2.4
five   2003   新乡  2.9

In [71]:
# del frame['pop'] 只能进行一次操作
frame

  data  year
0   北京  2000
1   上海  2001
2   郑州  2002
3   三亚  2002
4   新乡  2003

In [79]:
persional={'heigh':{'孔维云':168,'李麦青':153},
          'weight':{'李麦青':95,'孔维云':98}}

frame_1=pd.DataFrame(persional)
frame_1

     heigh  weight
孔维云    168      98
李麦青    153      95

In [83]:
pd.DataFrame(frame_1,index=['李麦青','孔维云']) # 可以自己指定排序方式

     heigh  weight
李麦青    153      95
孔维云    168      98

## reindex

method='ffill'前向填充

In [97]:
name=['孔维云','李麦青','孔得民','孔维龙']
frame_3=pd.Series(name,index=['a','b','c','d'])
frame_3
# frame_3.reindex(['a','b','c','d']) #修改index

a    孔维云
b    李麦青
c    孔得民
d    孔维龙
dtype: object

In [99]:
frame_4=frame_3.reindex(['a','b','c','d','e'])
frame_4

a    孔维云
b    李麦青
c    孔得民
d    孔维龙
e    NaN
dtype: object

In [102]:
frame_5=pd.Series(name)
frame_5

0    孔维云
1    李麦青
2    孔得民
3    孔维龙
dtype: object

In [103]:
frame_5.reindex(range(6),method='ffill')

0    孔维云
1    李麦青
2    孔得民
3    孔维龙
4    孔维龙
5    孔维龙
dtype: object

### drop
删除一条数据

In [116]:
frame=pd.Series(range(3,6),index=['a','b','c'])
frame

a    3
b    4
c    5
dtype: int64

In [117]:
frame.drop('c')

a    3
b    4
dtype: int64

In [120]:
frame=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['first','second','third','foured'],
                  columns=['1','2','3','4'])
frame

         1   2   3   4
first    0   1   2   3
second   4   5   6   7
third    8   9  10  11
foured  12  13  14  15

In [122]:
frame.drop('foured') #删除行

        1  2   3   4
first   0  1   2   3
second  4  5   6   7
third   8  9  10  11

In [123]:
frame.drop('1',axis=1) #删除列

         2   3   4
first    1   2   3
second   5   6   7
third    9  10  11
foured  13  14  15

In [124]:
frame #所有变化不改变原表格

         1   2   3   4
first    0   1   2   3
second   4   5   6   7
third    8   9  10  11
foured  12  13  14  15

In [127]:
frame.drop('1',axis=1,inplace=True)

KeyError: "['1'] not found in axis"

In [129]:
frame # inplace=True 改变原表格

         2   3   4
first    1   2   3
second   5   6   7
third    9  10  11
foured  13  14  15

### loc 和 iloc
    loc['行','列'] 名字
    iloc[行，列] 数字

In [130]:
fram=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['F','S','TH','FO'],
                 columns=['one','two','three','four'])
fram

    one  two  three  four
F     0    1      2     3
S     4    5      6     7
TH    8    9     10    11
FO   12   13     14    15

In [134]:
fram.loc['F','two']   #确定行和列就能取值

1

In [136]:
fram.iloc[2,1] # 通过为止索引，进行取值

9

### fill value

In [3]:
import pandas as pd
import numpy as np
df1=pd.DataFrame(np.arange(12).reshape((3,4)),
                columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [4]:
df1.loc[0,'b']=np.nan
df1

   a    b   c   d
0  0  NaN   2   3
1  4  5.0   6   7
2  8  9.0  10  11

In [10]:
df3=pd.DataFrame(np.arange(20).reshape((4,5)),
                columns=list('abcde'))
df3

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [11]:
df3.loc[1,'b']=np.nan
df3.loc[1,'e']=np.nan
df3

    a     b   c   d     e
0   0   1.0   2   3   4.0
1   5   NaN   7   8   NaN
2  10  11.0  12  13  14.0
3  15  16.0  17  18  19.0

In [12]:
# 直接相加
df1+df3 
#没有对应值后直接为空

      a     b     c     d   e
0   0.0   NaN   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [14]:
# add和fill_value配合使用
df1.add(df3,fill_value=0)
num+nun=num
nun+nun=nun

      a     b     c     d     e
0   0.0   1.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   NaN
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### 四则运算

    add,radd 加
    sub,rub 减
    div,rdiv 除
    floordiv,rfloordiv 整除
    mul,rmul 乘
    pow,rpow 次方

In [16]:
fram_1=pd.DataFrame(np.arange(20).reshape((5,4)),
                   columns=list('abcd'))
fram_1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [21]:
fram_2=pd.DataFrame(np.arange(20,40).reshape((5,4)),
                   columns=list('abcd'))
fram_2

    a   b   c   d
0  20  21  22  23
1  24  25  26  27
2  28  29  30  31
3  32  33  34  35
4  36  37  38  39

In [22]:
fram_1.sub(fram_2)

    a   b   c   d
0 -20 -20 -20 -20
1 -20 -20 -20 -20
2 -20 -20 -20 -20
3 -20 -20 -20 -20
4 -20 -20 -20 -20

In [23]:
fram_3=pd.DataFrame(np.random.randn(4,3),
                   columns=list('abc'),
                   index=['first','second','third','foursed'])
fram_3

                a         b         c
first   -0.943148 -0.008156  1.306156
second  -1.267745  1.730686  0.161985
third   -0.564189  1.706737 -0.042329
foursed  0.878877 -1.599142  0.493250

In [31]:
fram_4=fram_3.abs()  #abs 取绝对值
fram_4

                a         b         c
first    0.943148  0.008156  1.306156
second   1.267745  1.730686  0.161985
third    0.564189  1.706737  0.042329
foursed  0.878877  1.599142  0.493250

     要实现一列中最大值减去最小值的操作
         1.首先定义一个函数 f=lambda x:x.max()-x.min()

In [32]:
f=lambda x:x.max()-x.min()
fram_4.apply(f)

a    0.703556
b    1.722530
c    1.263828
dtype: float64

In [33]:
fram_4.apply(f,axis='columns')

first      1.298000
second     1.568702
third      1.664409
foursed    1.105893
dtype: float64

### sort 和 rank 都是排名

### 统计计算

In [36]:
# 建立一个有缺失值的表
df=pd.DataFrame(np.arange(20).reshape(4,5),
               columns=list('abcde'))
df.loc[0,['b','d']]=np.nan
df

    a     b   c     d   e
0   0   NaN   2   NaN   4
1   5   6.0   7   8.0   9
2  10  11.0  12  13.0  14
3  15  16.0  17  18.0  19

In [38]:
# 列向求和
df.sum(axis=0)
#nan默认为0

a    30.0
b    33.0
c    38.0
d    39.0
e    46.0
dtype: float64

In [40]:
df.sum(axis=1)

0     6.0
1    35.0
2    60.0
3    85.0
dtype: float64

In [41]:
df.describe() #查看数据的统计信息

               a     b          c     d          e
count   4.000000   3.0   4.000000   3.0   4.000000
mean    7.500000  11.0   9.500000  13.0  11.500000
std     6.454972   5.0   6.454972   5.0   6.454972
min     0.000000   6.0   2.000000   8.0   4.000000
25%     3.750000   8.5   5.750000  10.5   7.750000
50%     7.500000  11.0   9.500000  13.0  11.500000
75%    11.250000  13.5  13.250000  15.5  15.250000
max    15.000000  16.0  17.000000  18.0  19.000000

# 雅虎数据的一次实验

    看相关性
    协方差

In [44]:
import pandas_datareader.data as web
price=pd.read_pickle('D:\python学习\state_01\yahoo_price.pkl')
volume=pd.read_pickle('D:\python学习\state_01\yahoo_volume.pkl')

In [50]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [47]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [58]:
# 以百分比（percent）形式展示prices的变化情况
returns=price.pct_change()
returns
# returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [59]:
# 计算数值的相关性，例如AAPL和IBM的相关性
returns['AAPL'].corr(returns['IBM'])
#returns.AAPL.corr(returns.IBM)

0.38681743611391

In [60]:
# 计算协方差
returns['AAPL'].cov(returns['IBM'])

7.790052977103373e-05

In [61]:
# 返回一个相关性矩阵
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [62]:
# 返回一个协方差矩阵
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [64]:
# 每支股票与AAPL的相关性
returns.corrwith(returns.AAPL)

AAPL    1.000000
GOOG    0.407919
IBM     0.386817
MSFT    0.389695
dtype: float64

In [68]:
#成交量和价格变化百分比的相关性
volume.corrwith(returns)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### 注:这一章省去了很多不是很重要的内容，后续可以通过实例来学习
    第五章结束！！